In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.exc import SQLAlchemyError

In [2]:
df = pd.read_csv(r"C:\Users\tom_r\Desktop\crime data\Data-Science\TFL_cycling\data\FOI-1797-2223.csv")
df

,Station.Id,StationName,longitude,latitude,Easting,Northing
0,1,"River Street, Clerkenwell",-0.109971,51.529200,531202.520,182832.020
1,2,"Phillimore Gardens, Kensington",-0.197574,51.499600,525207.070,179391.860
2,3,"Christopher Street, Liverpool Street",-0.0846057,51.521300,532984.810,182001.530
3,4,"St. Chad's Street, King's Cross",-0.120974,51.530100,530436.760,182911.990
4,5,"Sedding Street, Sloane Square",-0.156876,51.493100,528051.649,178742.097
...,...,...,...,...,...,...
809,847,"South Bermondsey Station, Bermondsey",-0.0577746,51.488067,534945.000,178357.000
810,848,"Hariss Academy, Bermondsey",-0.0723507,51.492668,533920.000,178842.000
811,849,"Crimscott Street, Bermondsey",-0.078893,51.495598,533457.000,179156.000
812,850,"Brandon Street, Walworth",-0.0915489,51.489102,532597.000,178410.000
813,851,"The Blue, Bermondsey",-0.0625131,51.492221,534604.000,178810.000

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 814 entries, 0 to 813
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Station.Id   814 non-null    int64
 1   StationName  814 non-null    object
 2   longitude    814 non-null    object
 3   latitude     814 non-null    float64
 4   Easting      814 non-null    float64
 5   Northing     814 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 38.3+ KB

In [4]:
# convert station name to string datatype
df['StationName'] = df['StationName'].astype("string")

In [6]:
# convert long and lat to numeric datatypes
df['longitude'] = pd.to_numeric(df['longitude'])
df['latitude'] = pd.to_numeric(df['latitude'])

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 814 entries, 0 to 813
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Station.Id   814 non-null    int64
 1   StationName  814 non-null    string
 2   longitude    814 non-null    float64
 3   latitude     814 non-null    float64
 4   Easting      814 non-null    float64
 5   Northing     814 non-null    float64
dtypes: float64(4), int64(1), string(1)
memory usage: 38.3 KB

In [8]:
print(df.isna().sum())

Station.Id     0
StationName    0
longitude      0
latitude       0
Easting        0
Northing       0
dtype: int64

In [9]:
DB_USER = "postgres"
DB_PASSWORD = ""  # populate when using
DB_HOST = "localhost" 
DB_PORT = "5432"
DB_NAME = "tfl_cycling"

engine = create_engine(f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}")
conn = engine.connect()

df.to_sql("stations", engine, if_exists="replace", index=False)

814

In [10]:
print("success")

success